a = [1, 2, 3]
b = a
c = a.copy()
a.append(4)
print(f"a = {a}")   # 预测：a = [1, 2, 3, 4]
print(f"b = {b}")   # 预测：b = [1, 2, 3, 4]
print(f"c = {c}")   # 预测：c = [1, 2, 3]

x = (1, 2, [3, 4])
x[2].append(5)
print(x)            # 预测：(1, 2, [3, 4, 5])  这是合法的，因为元组的不可变是浅层的：元组本身的引用不能改变（b[x]的指向不可变），但是它不妨碍指向对象的内部是否可变，如果是可变的，如列表，是可以进行增删改的操作

d1 = {"a": 1}
d2 = d1
d2["b"] = 2
print(d1)           # 预测：{"a": 1, "b": 2}
print(d1 is d2)     # 预测：True，因为dict是可变的，d2 = d1，让两个变量指向同一个可变对象，所以d1和d2是同一个对象，对象改变，调用两个引用结果是一样的